// province cities
const eastazarbaijan1 = [
    'آذرشهر',
    'اسکو',
    'اهر',
    'بستان‌آباد',
    'بناب',
    'تبریز',
    'جلفا',
    'چاراویماق',
    'سراب',
    'شبستر',
    'مراغه'
  ]
  const westazarbaijan2 = [
    'ارومیه',
    'اشنویه',
    'بوکان',
    'پیرانشهر',
    'تکاب',
    'چالدران',
    'خوی',
    'سردشت',
    'سلماس',
    'شاهین‌دژ',
    'ماکو',
    'مهاباد',
    'میاندوآب',
    'نقده'
  ]
  const ardabil3 = ['اردبیل', 'بیله‌سوار', 'پارس‌آباد', 'خلخال', 'کوثر', 'گِرمی', 'مِشگین‌شهر', 'نَمین', 'نیر']
  const esfahan4 = [
    'آران و بیدگل',
    'اردستان',
    'اصفهان',
    'برخوار و میمه',
    'تیران و کرون',
    'چادگان',
    'خمینی‌شهر',
    'خوانسار',
    'سمیرم',
    'شهرضا',
    'سمیرم سفلی',
    'فریدن',
    'فریدون‌شهر',
    'فلاورجان',
    'کاشان',
    'گلپایگان',
    'لنجان',
    'مبارکه',
    'نائین',
    'نجف‌آباد',
    'نطنز'
  ]
  const ilam5 = ['آبدانان', 'ایلام', 'ایوان', 'دره‌شهر', 'دهلران', 'شیروان و چرداول', 'مهران']
  const booshehr6 = ['بوشهر', 'تنگستان', 'جم', 'دشتستان', 'دشتی', 'دیر', 'دیلم', 'کنگان', 'گناوه']
  const tehran7 = [
    'اسلام‌شهر',
    'پاکدشت',
    'تهران',
    'دماوند',
    'رباط‌کریم',
    'ری',
    'ساوجبلاغ',
    'شمیرانات',
    'شهریار',
    'فیروزکوه',
    'ورامین'
  ]
  const chaharmahalobakhtiari8 = ['اردل', 'بروجن', 'شهرکرد', 'فارسان', 'کوهرنگ', 'لردگان']
  const khorasanjonoobi9 = ['بیرجند', 'درمیان', 'سرایان', 'سربیشه', 'فردوس', 'قائنات', 'نهبندان']
  const khorasanrazavi10 = [
    'بردسکن',
    'تایباد',
    'تربت جام',
    'تربت حیدریه',
    'چناران',
    'خلیل‌آباد',
    'خواف',
    'درگز',
    'رشتخوار',
    'سبزوار',
    'سرخس',
    'فریمان',
    'قوچان',
    'کاشمر',
    'کلات',
    'گناباد',
    'مشهد',
    'مه ولات',
    'نیشابور'
  ]
  const khorasanshomali11 = ['اسفراین', 'بجنورد', 'جاجرم', 'شیروان', 'فاروج', 'مانه و سملقان']
  const khoozestan12 = [
    'آبادان',
    'امیدیه',
    'اندیمشک',
    'اهواز',
    'ایذه',
    'باغ‌ملک',
    'بندر ماهشهر',
    'بهبهان',
    'خرمشهر',
    'دزفول',
    'دشت آزادگان',
    'رامشیر',
    'رامهرمز',
    'شادگان',
    'شوش',
    'شوشتر'
  ]
  const zanjan13 = ['ابهر', 'ایجرود', 'خدابنده', 'خرمدره', 'زنجان', 'طارم', 'ماه‌نشان']
  const semnan14 = ['دامغان', 'سمنان', 'شاهرود', 'گرمسار', 'مهدی‌شهر']
  const sistanobaloochestan15 = [
    'ایرانشهر',
    'چابهار',
    'خاش',
    'دلگان',
    'زابل',
    'زاهدان',
    'زهک',
    'سراوان',
    'سرباز',
    'کنارک',
    'نیک‌شهر'
  ]
  const fars16 = [
    'آباده',
    'ارسنجان',
    'استهبان',
    'اقلید',
    'بوانات',
    'پاسارگاد',
    'جهرم',
    'خرم‌بید',
    'خنج',
    'داراب',
    'زرین‌دشت',
    'سپیدان',
    'شیراز',
    'فراشبند',
    'فسا',
    'فیروزآباد',
    'قیر و کارزین',
    'کازرون',
    'لارستان',
    'لامِرد',
    'مرودشت',
    'ممسنی',
    'مهر',
    'نی‌ریز'
  ]
  const qazvin17 = ['آبیک', 'البرز', 'بوئین‌زهرا', 'تاکستان', 'قزوین']
  const qom18 = ['قم']
  const kordestan19 = ['بانه', 'بیجار', 'دیواندره', 'سروآباد', 'سقز', 'سنندج', 'قروه', 'کامیاران', 'مریوان']
  const kerman20 = [
    'بافت',
    'بردسیر',
    'بم',
    'جیرفت',
    'راور',
    'رفسنجان',
    'رودبار جنوب',
    'زرند',
    'سیرجان',
    'شهر بابک',
    'عنبرآباد',
    'قلعه گنج',
    'کرمان',
    'کوهبنان',
    'کهنوج',
    'منوجان'
  ]
  const kermanshah21 = [
    'اسلام‌آباد غرب',
    'پاوه',
    'ثلاث باباجانی',
    'جوانرود',
    'دالاهو',
    'روانسر',
    'سرپل ذهاب',
    'سنقر',
    'صحنه',
    'قصر شیرین',
    'کرمانشاه',
    'کنگاور',
    'گیلان غرب',
    'هرسین'
  ]
  const kohkilooyevaboyrahmad22 = ['بویراحمد', 'بهمئی', 'دنا', 'کهگیلویه', 'گچساران']
  const golestan23 = [
    'آزادشهر',
    'آق‌قلا',
    'بندر گز',
    'ترکمن',
    'رامیان',
    'علی‌آباد',
    'کردکوی',
    'کلاله',
    'گرگان',
    'گنبد کاووس',
    'مراوه‌تپه',
    'مینودشت'
  ]
  const gilan24 = [
    'آستارا',
    'آستانه اشرفیه',
    'اَملَش',
    'بندر انزلی',
    'رشت',
    'رضوانشهر',
    'رودبار',
    'رودسر',
    'سیاهکل',
    'شَفت',
    'صومعه‌سرا',
    'طوالش',
    'فومَن',
    'لاهیجان',
    'لنگرود',
    'ماسال'
  ]
  const lorestan25 = ['ازنا', 'الیگودرز', 'بروجرد', 'پل‌دختر', 'خرم‌آباد', 'دورود', 'دلفان', 'سلسله ,کوهدشت']
  const mazandaran26 = [
    'آمل',
    'بابل',
    'بابلسر',
    'بهشهر',
    'تنکابن',
    'جویبار',
    'چالوس',
    'رامسر',
    'ساری',
    'سوادکوه',
    'قائم‌شهر',
    'گلوگاه',
    'محمودآباد',
    'نکا',
    'نور',
    'نوشهر'
  ]
  const markazi27 = ['آشتیان', 'اراک', 'مهاجران', 'تفرش', 'خمین', 'دلیجان', 'زرندیه', 'ساوه', 'شازند', 'کمیجان', 'محلات']
  const hormozgan28 = [
    'ابوموسی',
    'بستک',
    'بندر عباس',
    'بندر لنگه',
    'جاسک',
    'حاجی‌آباد',
    'شهرستان خمیر',
    'رودان',
    'قشم',
    'گاوبندی',
    'میناب'
  ]
  const hamedan29 = ['اسدآباد', 'بهار', 'تویسرکان', 'رزن', 'کبودرآهنگ', 'ملایر', 'نهاوند', 'همدان']
  const yazd30 = ['ابرکوه', 'اردکان', 'بافق', 'تفت', 'خاتم', 'صدوق', 'طبس', 'مهریز', 'مِیبُد', 'یزد']
  const alborz31 = ['کرج', 'نظرآباد', 'فردیس', 'اشتهارد', 'هشتگرد', 'طالقان']
  
  // provinces list
  module.exports.iranCities = [
    {
      name: 'آذربایجان شرقی',
      cities: eastazarbaijan1
    },
    {
      name: 'آذربایجان غربی',
      cities: westazarbaijan2
    },
    {
      name: 'اردبیل',
      cities: ardabil3
    },
    {
      name: 'اصفهان',
      cities: esfahan4
    },
    {
      name: 'ایلام',
      cities: ilam5
    },
    {
      name: 'بوشهر',
      cities: booshehr6
    },
    {
      name: 'تهران',
      cities: tehran7
    },
    {
      name: 'چهارمحال بختیاری',
      cities: chaharmahalobakhtiari8
    },
    {
      name: 'خراسان جنوبی',
      cities: khorasanjonoobi9
    },
    {
      name: 'خراسان رضوی',
      cities: khorasanrazavi10
    },
    {
      name: 'خراسان شمالی',
      cities: khorasanshomali11
    },
    {
      name: 'خوزستان',
      cities: khoozestan12
    },
    {
      name: 'زنجان',
      cities: zanjan13
    },
    {
      name: 'سمنان',
      cities: semnan14
    },
    {
      name: 'سیستان بلوچستان',
      cities: sistanobaloochestan15
    },
    {
      name: 'فارس',
      cities: fars16
    },
    {
      name: 'قزوین',
      cities: qazvin17
    },
    {
      name: 'قم',
      cities: qom18
    },
    {
      name: 'کردستان',
      cities: kordestan19
    },
    {
      name: 'کرمان',
      cities: kerman20
    },
    {
      name: 'کرمانشاه',
      cities: kermanshah21
    },
    {
      name: 'کهکیلویه و بویراحمد',
      cities: kohkilooyevaboyrahmad22
    },
    {
      name: 'گلستان',
      cities: golestan23
    },
    {
      name: 'گیلان',
      cities: gilan24
    },
    {
      name: 'لرستان',
      cities: lorestan25
    },
    {
      name: 'مازندران',
      cities: mazandaran26
    },
    {
      name: 'مرکزی',
      cities: markazi27
    },
    {
      name: 'هرمزگان',
      cities: hormozgan28
    },
    {
      name: 'همدان',
      cities: hamedan29
    },
    {
      name: 'یزد',
      cities: yazd30
    },
    {
      name: 'البرز',
      cities: alborz31
    }
  ]
  